use book;

insert into `goods`(bookId, title, author, price, category, publisher, imageCode, publishDate) values
('nobel01', '리틀 라이프1', '한야 야나기하라',13320,  'nobel', '시공사', 'n01', '2016-06-16'),
('nobel02', '모순', '양귀자', 11700, 'nobel', '쓰다', 'n02', '2013-04-01'),
('nobel03', '나의 돈키호테', '김호연', 16200, 'nobel', '나무옆의자', 'n03', '2024-04-25'),
('nobel04', '녹나무의 여신', '히가시노 게이고', 16920, 'nobel', '소미미디어', 'n04', '2024-05-23'),
('nobel05', '흐르는 강물처럼',' 셀리 리드', 15300, 'nobel', '다산책방', 'n05', '2024-01-08'),
('nobel06', '구의 증명', '최진영', 10800, 'nobel', '은행나무', 'n06', '2023-04-26'),
('nobel07', '싯다르타', '헤르만 헤세', 7200, 'nobel', '민음사', 'n07', '2002-01-20'),
('nobel08', '두 사람의 인터내셔널', '김기태', 15120, 'nobel', '문학동네', 'n08', '2024-05-15'),
('nobel09', '불편한 편의점', '김호연', 12600, 'nobel', '나무옆의자', 'n09', '2021-04-20'),
('nobel10', '인간 실격', '다자이 오사무', 8100, 'nobel', '민음사', 'n10', '2012-04-10');




insert into `goods`(bookId, title, author, price, category, publisher, imageCode, publishDate) values
('magazine01','톱클래스(topclass)(2024년 7월호)','조선뉴스프레스 편집부',10450, 'magazine','조선뉴스프레스','m01','2024-06-26'),
('magazine02','엘르(ELLE)(2024년 7월호)','허스트중앙 편집부',17960, 'magazine','허스트중앙','m02','2024-06-25'),
('magazine03','Vogue(Italia)(2024년 6월호)','유피에이 편집부',22800, 'magazine','유피에이','m03','2024-06-14'),
('magazine04','Slam(2024년 6/7월호)','유피에이 편집부',20900, 'magazine', '유피에이','m04','2024-06-14'),
('magazine05','GQ(USA)(2024년 SUMMER)','유피에이 편집부',20900, 'magazine','유피에이','m05','2024-06-14'),
('magazine06','주부생활(2024년 7월호)','더북컴퍼니 편집부',9500, 'magazine','더북컴퍼니','m06','2024-06-24'),
('magazine07','얼루어(2024년 7월호)','두산매거진 편집부',9500, 'magazine','두산매거진','m07','2024-06-24'),
('magazine08','마리끌레르(2024년 7월호)', 'MCK퍼블리싱 편집부',8550, 'magazine','MCK퍼블리싱','m08','2024-06-20'),
('magazine09','엠엠재즈(MM Jazz)(2024년 6월 310호)','SJA뮤직 편집부',6460, 'magazine','SJA뮤직','m09','2024-06-13'),
('magazine10','인슈어런스(2024년 6월 363호)','보험일보사 편집부',8550, 'magazine','보험일보사','m10','2024-06-13');


insert into `goods`(bookId, title, author, price, category, publisher, imageCode, publishDate) values
('comic01','상사상애6','liberum',4500,'comic','대원씨아이','c01','2024-06-01'),
('comic02','다다미 넉 장 반의 가시공주1','Zakuri Sato',5400,'comic','대원씨아이','c02','2024-06-01'),
('comic03','플라타너스의 열매','히가시모토 토시야',4950,'comic','대원씨아이','c03','2024-06-01'),
('comic04','프런티어 다이어리3','아베 하나지로', 4500,'comic','YNK미디어','c04','2024-06-15'),
('comic05','파티오의 임금님들 4','오오야 카즈미',5400,'comic','YNK미디어','c05','2024-06-15');


