use book;

insert into `goods`(bookId, title, author, price, category, publisher, imageCode, publishDate) values
('nobel01', '리틀 라이프1', '한야 야나기하라',13320,  'nobel', '시공사', 'n01', '2016-06-16'),
('nobel02', '모순', '양귀자', 11700, 'nobel', '쓰다', 'n02', '2013-04-01'),
('nobel03', '나의 돈키호테', '김호연', 16200, 'nobel', '나무옆의자', 'n03', '2024-04-25'),
('nobel04', '녹나무의 여신', '히가시노 게이고', 16920, 'nobel', '소미미디어', 'n04', '2024-05-23'),
('nobel05', '흐르는 강물처럼',' 셀리 리드', 15300, 'nobel', '다산책방', 'n05', '2024-01-08'),
('nobel06', '구의 증명', '최진영', 10800, 'nobel', '은행나무', 'n06', '2023-04-26'),
('nobel07', '싯다르타', '헤르만 헤세', 7200, 'nobel', '민음사', 'n07', '2002-01-20'),
('nobel08', '두 사람의 인터내셔널', '김기태', 15120, 'nobel', '문학동네', 'n08', '2024-05-15'),
('nobel09', '불편한 편의점', '김호연', 12600, 'nobel', '나무옆의자', 'n09', '2021-04-20'),
('nobel10', '인간 실격', '다자이 오사무', 8100, 'nobel', '민음사', 'n10', '2012-04-10');

insert into `goods`(bookId, title, author, price, category, publisher, imageCode, publishDate) values
('magazine01','톱클래스(topclass)(2024년 7월호)','조선뉴스프레스 편집부',10450, 'magazine','조선뉴스프레스','m01','2024-06-26'),
('magazine02','엘르(ELLE)(2024년 7월호)','허스트중앙 편집부',17960, 'magazine','허스트중앙','m02','2024-06-25'),
('magazine03','Vogue(Italia)(2024년 6월호)','유피에이 편집부',22800, 'magazine','유피에이','m03','2024-06-14'),
('magazine04','Slam(2024년 6/7월호)','유피에이 편집부',20900, 'magazine', '유피에이','m04','2024-06-14'),
('magazine05','GQ(USA)(2024년 SUMMER)','유피에이 편집부',20900, 'magazine','유피에이','m05','2024-06-14'),
('magazine06','주부생활(2024년 7월호)','더북컴퍼니 편집부',9500, 'magazine','더북컴퍼니','m06','2024-06-24'),
('magazine07','얼루어(2024년 7월호)','두산매거진 편집부',9500, 'magazine','두산매거진','m07','2024-06-24'),
('magazine08','마리끌레르(2024년 7월호)', 'MCK퍼블리싱 편집부',8550, 'magazine','MCK퍼블리싱','m08','2024-06-20'),
('magazine09','엠엠재즈(MM Jazz)(2024년 6월 310호)','SJA뮤직 편집부',6460, 'magazine','SJA뮤직','m09','2024-06-13'),
('magazine10','인슈어런스(2024년 6월 363호)','보험일보사 편집부',8550, 'magazine','보험일보사','m10','2024-06-13');

insert into goods (bookId, title, author, price, category, publisher, imageCode, publishDate)
values('exambook01', '2024 해커스 AFPK 최종 실전모의고사 3회분', '해커스 금융아카데미', 20000, 'exambook', '해커스금융', 'e01', '2024-06-05'),
	   ('exambook02', '2024 외환전문역 1종 최종정리문제집', '와우패스 교수진', 24000, 'exambook', '와우패스', 'e02', '2024-06-01'),
	   ('exambook03', '2024 써니 행정법총론 봉투모의고사+시험장 옳은 지문 워크북', '박준철', 9000, 'exambook', '지금', 'e03', '2024-04-11'),
	   ('exambook04', '2024 해커스경찰 갓대환 형사법 진도별 문제풀이 1000제 2차 시험 대비', '김대환', 37000, 'exambook', '해커스경찰', 'e04', '2024-06-03'),
	   ('exambook05', '사회초년생을 위한 꼰대 어휘 속성과외', '김학준', 23000, 'exambook', '마카렌세스', 'e05', '2024-06-07'),
	   ('exambook06', '디자인보호법 공방', '이준권', 20000, 'exambook', '윌비스', 'e06', '2024-06-18'),
	   ('exambook07', '논리개념 매뉴얼 5.5 세트', '이해황', 42900, 'exambook', '법률저널', 'e07', '2024-01-10'),
	   ('exambook08', '2024 해커스 은행FP 자산관리사 2부 최종핵심정리문제집', '해커스 금융아카데미', 18000, 'exambook', '해커스금융', 'e08', '2024-06-11'),
	   ('exambook09', '영어 면접 핵심패턴 233', '이지윤', 17000, 'exambook', '길벗이지톡', 'e09', '2020-07-15'),
	   ('exambook10', '수의사가 말하는 수의사 Episode 2', '이학범', 14900, 'exambook', '부키', 'e10', '2024-06-05');
	  
insert into goods (bookId, title, author, price, category, publisher, imageCode, publishDate)
values('poemessay01', '당신은 결국 무엇이든 해내는 사람', '김상현', 17000, 'poemessay', '필름(Feelm)', 'p01', '2022-04-20'),
	   ('poemessay02', '나는 메트로폴리탄 미술관의 경비원입니다', '패트릭 브링리', 17500, 'poemessay', '웅진지식하우스', 'p02', '2023-11-24'),
       ('poemessay03', '허송세월', '김훈', 18000, 'poemessay', '나남', 'p03', '2024-06-20'),
       ('poemessay04', '오늘 가장 빛나는 너에게', '이재은', 19800, 'poemessay', '더퀘스트', 'p04', '2024-06-14'),
       ('poemessay05', '그럼에도 불구하고 나는 내가 좋았어', '박채린', 18000, 'poemessay', '북플레저', 'p05', '2024-06-12'),
       ('poemessay06', '찌그러져도 동그라미입니다', '김창완', 17800, 'poemessay', '웅진지식하우스', 'p06', '2024-03-28'),
       ('poemessay07', '당근밭 걷기', '안희연', 12000, 'poemessay', '문학동네', 'p07', '2024-06-15'),
       ('poemessay08', '꽃길이 따로 있나, 내 삶이 꽃인 것을', '오평선', 16800, 'poemessay', '포레스트북스', 'p08', '2024-03-22'),
       ('poemessay09', '보편의 단어', '이기주', 16000, 'poemessay', '말글터', 'p09', '2024-01-11'),
       ('poemessay10', '그 속에서 놀던', '택리지', 37000, 'poemessay', '테라코타', 'p10', '2024-06-17');
       
insert into `goods`(bookId, title, author, price, category, publisher, imageCode, publishDate) values
('comic01','상사상애6','liberum',4500,'comic','대원씨아이','c01','2024-06-01'),
('comic02','다다미 넉 장 반의 가시공주1','Zakuri Sato',5400,'comic','대원씨아이','c02','2024-06-01'),
('comic03','플라타너스의 열매','히가시모토 토시야',4950,'comic','대원씨아이','c03','2024-06-01'),
('comic04','프런티어 다이어리3','아베 하나지로', 4500,'comic','YNK미디어','c04','2024-06-15'),
('comic05','파티오의 임금님들 4','오오야 카즈미',5400,'comic','YNK미디어','c05','2024-06-15'),
('comic06', '원피스 108: 죽는 편이 나은 세계', 'EIICHIRO ODA', 5500, 'comic', '대원씨아이', 'c06', '2024-05-29'),
('comic07', '스파이 패밀리 13', 'Tatsuya Endo', 6000, 'comic', '학산문화사', 'c07', '2024-06-25'),
('comic08', '쿠이 료코 낙서집 데이드림 아워', '쿠이 료코 ', 20000, 'comic', '소미미디어', 'c08', '2024-06-04'),
('comic09', '나 혼자만 레벨업 11(만화)', '장성락', 16000, 'comic', '디앤씨미디어', 'c09', '2024-06-04'),
('comic10', '나의 히어로 아카데미아 40', 'Kohei Horikoshi', 6000, 'comic', '서울미디어코믹스(서울문화사)', 'c10', '2024-05-31');